# main:
# -52 - i в for с printf("A[%d] =", i);
# -56 - i в for с A[i] = rand() % 10;
# -168 - i в for с fprintf
# -164 - i в for с fscanf
# -128 = поток "input.txt"
# -88 = поток "output.txt"
# -180 = answer
# -184 = length
# -196 = argc
# -208 = argv
# -80 = struct timespec sec;
# -72 = srand(sec.tv_nsec);

# -120 = указаткль намассив A[] с аргументов командной 
# строки и его переменные
# -120
# -224
# -216
# -240
# -232

# -136 = указаткль на массив B[] с аргументов командной 
# строки и его переменные
# -104
# -256
# -248
# -272
# -264

# -152 = указаткль на массив A[]
# -160
# -288
# -280
# -304
# -296

# -136 = указаткль на массив B[]
# -144
# r14
# r15d
# r12
# r13d

# print:
# -24 = указаткль на массив B[]
# -28 = length
# -4 = i в for c printf("%d ", B[i]);

# task:
# -24 = указаткль на массив A[]
# -28 = length
# -40 = указаткль на массив B[]
# -4 = count;